content/posts/pandas_notes.md
+++
title = "Notes on learning Pandas"
author = ["Stanislav Arnaudov"]
description = "My notes on pandas when I started looking into the library"
date = 2018-07-13T00:00:00+02:00
keywords = ["machine-learning", "python", "pandas"]
lastmod = 2019-10-12T11:27:00+02:00
categories = ["machine-learning"]
draft = false
weight = 100
+++

<div class="NOTES">
  <div></div>

For transparency's sake - those are my notes while learning about _pandas_ from [this](https://www.tutorialspoint.com/python%5Fpandas/index.htm%20) tutorial. At times this here is just copy-paste from it, at others, it's my own thoughts and explanations. This is meant to be a condensed version of the tutorial more or less just for me. If you found it useful though, well, good for you, I guess.

</div>


## Abstract {#abstract}


### Basic {#basic}

**pandas** is a Python package providing fast, flexible, and expressive data structures designed to make working with "relational Heterogeneous data" or "labeled" data both easy and intuitive. It aims to be the fundamental high-level building block for doing practical, **real world** data analysis in Python. Additionally, it has the broader goal of becoming the most powerful and flexible open-source data analysis/manipulation tool available in any language. It is already well on its way toward this goal. <br /> <br /> It's like database-like objects to deal with your data.

-   data could be loaded from _.csv_ files and be written again
-   some basic statistical analysis is possible


### Features {#features}

A shortlist of features as advertised on the official site of _pandas_.

-   Fast and efficient DataFrame object with the default and customized indexing.
-   Tools for loading data into in-memory data objects from different file formats.
-   Data alignment and integrated handling of missing data.
-   Reshaping and pivoting of data sets.
-   Label-based slicing, indexing, and subsetting of large data sets.
-   Columns from a data structure can be deleted or inserted.
-   Group by data for aggregation and transformations.
-   High-performance merging and joining of data.
-   Time Series functionality.


### Tl;DR {#tl-dr}

Managing data in structures and easily manipulating the data.


## Basic Structures {#basic-structures}


### DataFrame {#dataframe}

It's like a table in RDB.

-   Columns are attributes
-   Rows are the actual data
-   Indices are the labels for each row

This is the most common object when dealing with data and using _pandas_. The data in the object is heterogeneous, the shape and the size are mutable. The last part means that the models you build in one object that contains data can easily(ish) be transformed into another model(by model I mean the way your data is structured- names and count of columns(attributes), indexing of the rows, type of the data inside). <br /> <br /> The basic construction of the DataFrame object is as follows:

```python
pandas.DataFrame( data, index, columns, dtype, copy)
```

-   `data` - ndarray, series, map, lists, dict, constants..etc. The raw data that will be stored in the DataFame. This could be for example a list of lists. In this case, the 'inner' lists will become the columns and the column names will be given through **columns**. The number of the columns must be the same as the number of inner lists
-   `index` - the 'names' of the rows. Usually just an index (0,1,2,3....). The size of this must be the count of the entries in the dataset
-   `columns` - the names of the columns
-   ... - the other ones are none of our concern

Some of the constructions:

```python
import panda as pd
import numpy as np


data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(
    data,
    columns=['Name','Age'])

df = pd.DataFrame(
    np.random.randn(10, 3),
    columns = ['col1','col2','col3']
)

data = {
    'Name':['Tom', 'Jack', 'Steve', 'Ricky'],
    'Age':[28,34,29,42]
}
df = pd.DataFrame(data)

data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])


d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
      'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)
```

All of the constructions are pretty intuitive and easy to understand. The thing to remember - all of the possible way that you can construct _DataFrame_. <br /> <br /> The column selections is just as easy:

```python
df['column_name'] # return an Series containing the data in the respective column
```

Adding of columns is possible:

```python
 #Adding a new column by passing as Series
df['new']=pd.Series([10,20,30],index=['a','b','c'])
print df
```

as well as deletion:

```python
del df['important']
```

Selection of rows either by index or by lable (the thing that was in the **index** attribute in the constructor)

```python
df.loc['b']  # by lable
df.iloc[2]   # by index
df[2:4]      # splicing
```

Appending rows to an existing _DataFrame_

```python
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df = df.append(df2)
```


### Series {#series}

Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index. Construction:

```python
pandas.Series( data, index, dtype, copy)
```

The same thing as the _DataFrame_! Some examples:

```python
data = np.array(['a','b','c','d'])
s = pd.Series(data,index=[100,101,102,103])

data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data)

print s[0]

print s[1:3]

print s[-3:] # the last three elements

```


### DataPanel {#datapanel}

From what I understand, this is not widely used and I don't think I need it for my project so... nah. <span class="underline">Skip!!!</span>


## Basic usage {#basic-usage}


### DataFrame basic function {#dataframe-basic-function}

The most useful functions of the DataFrame-class

-   `T` : Transposes rows and columns.
-   `axes` : returns a list with the row axis labels and column axis labels as the only members.
-   `dtypes`: Returns the dtypes in this object.
-   `empty` : True if NDFrame is entirely empty [no items]; if any of the axes are of length 0.
-   `ndim` : umber of axes / array dimensions. This is just two
-   `shape` : Returns a tuple representing the dimensionality of the DataFrame. The first element is the number of rows, the second - the number of attributes
-   `size` : umber of elements in the NDFrame.
-   `values`: Numpy representation of NDFrame.
-   `head()`: Returns the first n rows. Could be used as `df.head(n)/df.tail(n)` to get the first/last **n** elements.
-   `tail()`: Returns last n rows.
