org/posts/pandas_notes.org
** Basic statistics
A bunch of simple 'statistical' functions can be applied on the columns of a DataFrame object. Those include:
- ~count()~   : Number of non-null observations
- ~sum()~     : Sum of values
- ~mean()~    : Mean of Values
- ~median()~  : Median of Values
- ~mode()~    : Mode of values
- ~std()~     : Standard Deviation of the Values
- ~min()~     : Minimum Value
- ~max()~     : Maximum Value
- ~abs()~     : Absolute Value
- ~prod()~    : Product of Values
- ~cumsum()~  : Cumulative Sum
- ~cumprod()~ : Cumulative Product
An example that demonstrates some of these:
#+BEGIN_SRC python
import pandas as pd
import numpy as np

#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])}

#Create a DataFrame
df = pd.DataFrame(d)
print df.mean()
print df['Age'].mean()
print df['Age'].min()
print df['Age'].max()
print df['Age'].std()
#+END_SRC
There exists also a =describe= function that shows summarized information about the data in the /DataFrame/. This includes ~mean~, ~std~ and *IQR* values. The function excludes the textual columns and looks only at the numeric columns. *include* is the argument which is used to pass necessary information regarding what columns need to be considered for summarizing. It can be:
    - ~object~ − Summarizes String columns
    - ~number~ − Summarizes Numeric columns
    - ~all~ − Summarizes all columns together

#+BEGIN_SRC python
import pandas as pd
import numpy as np

#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])}

#Create a DataFrame
df = pd.DataFrame(d)
print df.describe()
#+END_SRC
This gives us:
|       |       Age |    Rating |
|-------+-----------+-----------|
| count | 12.000000 | 12.000000 |
| mean  | 31.833333 |  3.743333 |
| std   |  9.232682 |  0.661628 |
| min   | 23.000000 |  2.560000 |
| 25%   | 25.000000 |  3.230000 |
| 50%   | 29.500000 |  3.790000 |
| 75%   | 35.500000 |  4.132500 |
| max   | 51.000000 |  4.800000 |
OK, kinda. The table is from me and I am kinda showing off.


* Applying Functions on data in /DataFrame/
There are a few ways that we can transform a /DataFrame/ into another one by applying a map-like function on the data. Depending on our needs we have the following options:
- ~pipe()~ - Table wise Function Application: 
- ~apply()~ - Row or Column Wise Function Application
- ~applymap()~ - Element wise Function Application
** Piping
From the official documentation:
#+BEGIN_QUOTE
Use .pipe when chaining together functions that expect Series, /DataFrames/ or /GroupBy/ objects

#+END_QUOTE
From what I understand - One would use that when applying a bunch of functions on all elements of /DataFrame/ (or whatever) while still having the possibility that the applied function takes more than just one argument. For example, let's add two to every element in /DataFrame/ through an adder function that just adds its two arguments.
#+BEGIN_SRC python
import pandas as pd
import numpy as np

def adder(ele1,ele2):
   return ele1+ele2

df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
df = df.pipe(adder,2)
print(df)
#+END_SRC
We can also do something like this:

#+BEGIN_SRC python
df.pipe(foo_fun1, arg1=1).
pipe(foo_fun2, arg2=2).
pipe(foo_fun3, arg3=3)
#+END_SRC
This applies the three functions one after the other while the second argument of those functions is 1, 2 and 3.
** Applying
The ~apply~ function of /DataFrame/ applies function on whole columns(or rows). The given function to be applied must take one argument - Series - and return again a Series. Think of it like that - they give you a whole array of numbers, you make something with it and give back a different (or not different) array of the same size. An illustrative example:
#+BEGIN_SRC python :exports both
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
return df.apply(np.mean)
#+END_SRC

Which gives us:

: col1    0.228874
: col2   -0.561032
: col3   -0.321606
: dtype: float64
Note how the *np.mean* return a single number so in the final result there is only one row - the mean of each column.
** ApplyMap
Not all functions can be vectorized (neither the Numpy arrays which return another array nor any value), the methods ~applymap()~ on DataFrame and analogously map() on Series accept any Python function taking a single value and returning a single value. This is similar to the *pipe* but it's less flexible. It just treats the whole /DataFrame/ as on a big list and performs a mapping function on it.
Example:
#+BEGIN_SRC python
import pandas as pd
import numpy as np

# My custom function
df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
return df.applymap(lambda x:x*100)
#+END_SRC

#+RESULTS:

With result:
 
: col1        col2        col3
: 0  124.741017  -39.997356 -197.724001
: 1  -83.817763   56.487720  -16.127531
: 2  173.797264  187.089676  -38.871016
: 3  -94.927338  -60.133882   15.271702
: 4 -167.875460   83.420648 -179.131762


* Iterating and sorting over data in structures
** Iterating /DataFrame/
Using a /DataFrame/ object in a plane /for/-loop iterates over the names of the columns.

#+BEGIN_SRC python :results output
import pandas as pd

df = pd.DataFrame({
    'A': [1,2,3,4,5],
    'x': [1,2,3,4,5],
    'y': [1,2,3,4,5],
    'C': [1,2,3,4,5],
    'D': [1,2,3,4,5]
    })

for col in df:
   print(col)
#+END_SRC
This just prints A, B, C,...,etc.
 
: A
: C
: D
: x
: y
\\
\\
Iterating over the date in the /DataFrame/ can be done in several ways:
- ~iteritems()~ − to iterate over the (key,value) pairs. Key here again is the 'index'-name-thing that is configurable through the *index* in the constructor.
- ~iterrows()~ − iterate over the rows as (index,series) pairs. Here the index is just a number.
- ~itertuples()~ − iterate over the rows as named tuples
The most useful of the above is probably ~iterrows()~.
#+BEGIN_SRC python :results output
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(4,3),columns = ['col1','col2','col3'])
for row_index,row in df.iterrows():
   print(str(row_index) + "\n" + str(row))
#+END_SRC

 
#+begin_example
0
col1    2.117955
col2   -0.263560
col3   -0.600124
Name: 0, dtype: float64
1
col1   -0.620081
col2   -1.355647
col3   -0.568608
Name: 1, dtype: float64
2
col1    1.792265
col2   -0.494137
col3   -1.395912
Name: 2, dtype: float64
3
col1   -1.189506
col2   -0.479746
col3    0.329728
Name: 3, dtype: float64
#+end_example
To note is that the iterated /row/-objects contain information for each column so if you want to get the second column of the row:
#+BEGIN_EXAMPLE
row.col2
#+END_EXAMPLE
