content/posts/pandas_notes.md


### Sorting _DataFrame_ {#sorting-dataframe}

There are two possibilities for sorting:

1.  By lable - i. e. by index
2.  By value of some column

The first one is useful when the data is saved out of order. By appropriately creating the index in the construction and then sorting by lable, you can load the data in memory in the right order. <br /> <br /> The two functions are:

-   `sort_index([ascending=True/False])`
-   `sort_values(by=col_name,[ascending=True/False])`

By default _ascending_ is set to _True_. Example:

```python
import pandas as pd
import numpy as np

unsorted_df = pd.DataFrame(
    np.random.randn(10,2),
index=[1,4,6,2,3,5,9,8,0,7],
    columns = ['col2','col1']
)

sorted_index_df = unsorted_df.sort_index()
sorted_val_df = unsorted_df.sort_values(by='col2')

print(sorted_index_df)
print("-------------")
print(sorted_val_df)
```

Output:

```text
       col2      col1
0  0.562948  0.768513
1  1.776865 -0.217141
2 -0.040029 -2.300772
3 -1.695105  0.294038
4  0.163922  0.934361
5  0.998288 -1.149822
6 -0.641102  0.539689
7  1.190690  0.027898
8  0.745714  0.916117
9  0.144558  2.581345
-------------
       col2      col1
3 -1.695105  0.294038
6 -0.641102  0.539689
2 -0.040029 -2.300772
9  0.144558  2.581345
4  0.163922  0.934361
0  0.562948  0.768513
8  0.745714  0.916117
5  0.998288 -1.149822
7  1.190690  0.027898
1  1.776865 -0.217141
```


## Slicing {#slicing}

There are several custom ways of slicing through data that are optimized and are the recommended way of slicing data when dealing with production code.

1.  **loc()** - label based indexing. Used as df.loc[</rows/>,</columns/>]. For _rows_ and _columns_ could be given pretty much everything that makes sense - single char, list of labels, slice object, boolean array.

    ```python
    df.loc[['a','b','f','h'],['A','C']]
    ```
2.  **iloc()** - index based indexing. Used the same way as **loc()** but just with integer indices.

    ```python
    df.iloc[1:5, 2:4]
    ```


## Tougher statistics {#tougher-statistics}


### Some functions {#some-functions}

There are some useful statistical functions already in _pandas_ that help with the understanding and analyzing the behavior of data

1.  **Percent\_change** -This function compares every element with its prior element and computes the change percentage.

    ```python
    import pandas as pd
    import numpy as np
    s = pd.Series([1,2,3,4,5,4])
    print(s.pct_change())
    print("-----")
    df = pd.DataFrame(np.random.randn(5, 2))
    print(df.pct_change())
    ```

Gives us:

```text
0         NaN
1    1.000000
2    0.500000
3    0.333333
4    0.250000
5   -0.200000
dtype: float64
-----
          0          1
0       NaN        NaN
1 -1.156977 -16.169034
2  0.234270  -0.647137
3 -3.203838  -1.043420
4 -1.548769  -9.686350
```

The first row is _NaN_ because there is no previous element to compare it to.

1.  **Covariance** - the _Series_ object has a method **cov** to compute covariance between two objects.

```python
import pandas as pd
import numpy as np
s1 = pd.Series(np.random.randn(10))
s2 = pd.Series(np.random.randn(10))
print(s1.cov(s2))
```

Output:

```text
-0.23077206068332465
```

_NaN_ values are ignored automatically.

1.  **Correlation** - the natural follow up of course.

```python
import pandas as pd
import numpy as np
frame = pd.DataFrame(np.random.randn(10, 5), columns=['a', 'b', 'c', 'd', 'e'])

print( frame['a'].corr(frame['b']))
print("-------")
print( frame.corr())
```

The latter table shows in each cell shows what is the correlation between the respective columns.

```text
0.584632830437208
-------
          a         b         c         d         e
a  1.000000  0.584633  0.178898 -0.199928 -0.073022
b  0.584633  1.000000  0.045907  0.111284  0.006680
c  0.178898  0.045907  1.000000 -0.455127  0.065576
d -0.199928  0.111284 -0.455127  1.000000 -0.596656
e -0.073022  0.006680  0.065576 -0.596656  1.000000
```


### Window statistics {#window-statistics}

Some of the supported operations are:

1.  Rolling - Imagine a window that rolls over the data and computes 'something' with the elements that are currently in the window. Usueall the restult is written then in the first element of the wondow. The function in use here is **rolling(windows=/window\_size/)**

```python
import pandas as pd
import numpy as np

df = pd.DataFrame(
    np.random.randn(10, 4),
    index = pd.date_range('1/1/2000', periods=10),
    columns = ['A', 'B', 'C', 'D']
)
print(df.rolling(window=3).mean())
```

```text
                   A         B         C         D
2000-01-01       NaN       NaN       NaN       NaN
2000-01-02       NaN       NaN       NaN       NaN
2000-01-03  0.448896 -0.457281 -0.320112 -0.629398
2000-01-04  0.142268 -0.523835 -0.627615  0.228978
2000-01-05 -0.200259 -1.242848 -0.683303 -0.575579
2000-01-06 -0.867429 -0.211049 -0.207560  0.048380
2000-01-07 -1.117081 -0.268690  0.053126 -0.376906
2000-01-08 -1.117306  0.142617 -0.295222 -0.505522
2000-01-09 -0.324298 -0.065450 -0.333431 -1.186115
2000-01-10 -0.186834 -0.131418 -0.530804 -0.624335
```

The window is big 3-elements and therefore the first two rows don't have the needed neighbors.

1.  Expanding - Calculate something for the first element, then for the first and second together, then for the first, second and third together and so forth. This is done with **expanding(min\_periods=n)**. _min\_periods_ shows when the computations begin (the number of rows needed in order the generated row not to be _NaN_).

    ```python
    import pandas as pd
    import numpy as np

    df = pd.DataFrame(np.random.randn(10, 4),
                      index = pd.date_range('1/1/2000', periods=10),
                      columns = ['A', 'B', 'C', 'D'])
    print(df.expanding(min_periods=3).mean())
    ```

```text
                   A         B         C         D
2000-01-01       NaN       NaN       NaN       NaN
2000-01-02       NaN       NaN       NaN       NaN
2000-01-03  1.330880 -0.758586  0.172522  0.657721
2000-01-04  1.161148 -0.147130 -0.110188  0.473314
2000-01-05  0.565535  0.120415 -0.038158  0.647995
2000-01-06  0.721102  0.268228 -0.037819  0.563833
2000-01-07  0.734176  0.232185 -0.090012  0.420967
2000-01-08  0.681839  0.240921 -0.204159  0.223472
2000-01-09  0.772570  0.121897  0.053970  0.105342
2000-01-10  0.837397  0.266325  0.109070  0.280632
```

1.  Exponentially moving weights - Not sure for the exact mathematics of this one, but...it averages the data in some weird way. It's used to get the 'general idea' for the behaiviour of the data

    ```python
    import pandas as pd
    import numpy as np

    df = pd.DataFrame(np.random.randn(10, 4),
                      index = pd.date_range('1/1/2000', periods=10),
                      columns = ['A', 'B', 'C', 'D'])
    print( df.ewm(com=0.5).mean())
    ```
