org/posts/pandas_notes.org
** Grouping and Aggregating
In many situations the following 'pipeline' occurs:
1. Split and object by grouping it entries by some key
2. Perform some operations to get a single number for each group
3. Combine the result into a new object
The second step could have some variations. Maybe we can want to transform or filter the data but the general idea stays. Pandas offers some great functions to achieve all of this.
\\
\\
Firstly, in order to create the groups we can use the *groupby()* function. It can take the name of single column or multiple ones. In the latter case, the appropriate combinations between the keys of the columns are generated. Each combinations is it's own group. Once the grouping object is created, the groups can be examined with ~gr.groups~. The groups can also be easly iterated over. Selecting a group is also easy by specifying its key.
\\
\\
Summarizing example:
#+BEGIN_SRC python :results output
import pandas as pd
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
gr = df.groupby(['Team','Year'])

print(gr.groups)
print("------")
for name,group in gr:
    print(name)
    print(group)
print("-----")
print(gr.get_group(('Riders', 2014)))

#+END_SRC

 
#+begin_example
{('Devils', 2014): Int64Index([2], dtype='int64'), ('Devils', 2015): Int64Index([3], dtype='int64'), ('Kings', 2014): Int64Index([4], dtype='int64'), ('Kings', 2016): Int64Index([6], dtype='int64'), ('Kings', 2017): Int64Index([7], dtype='int64'), ('Riders', 2014): Int64Index([0], dtype='int64'), ('Riders', 2015): Int64Index([1], dtype='int64'), ('Riders', 2016): Int64Index([8], dtype='int64'), ('Riders', 2017): Int64Index([11], dtype='int64'), ('Royals', 2014): Int64Index([9], dtype='int64'), ('Royals', 2015): Int64Index([10], dtype='int64'), ('kings', 2015): Int64Index([5], dtype='int64')}
------
('Devils', 2014)
   Points  Rank    Team  Year
2     863     2  Devils  2014
('Devils', 2015)
   Points  Rank    Team  Year
3     673     3  Devils  2015
('Kings', 2014)
   Points  Rank   Team  Year
4     741     3  Kings  2014
('Kings', 2016)
   Points  Rank   Team  Year
6     756     1  Kings  2016
('Kings', 2017)
   Points  Rank   Team  Year
7     788     1  Kings  2017
('Riders', 2014)
   Points  Rank    Team  Year
0     876     1  Riders  2014
('Riders', 2015)
   Points  Rank    Team  Year
1     789     2  Riders  2015
('Riders', 2016)
   Points  Rank    Team  Year
8     694     2  Riders  2016
('Riders', 2017)
    Points  Rank    Team  Year
11     690     2  Riders  2017
('Royals', 2014)
   Points  Rank    Team  Year
9     701     4  Royals  2014
('Royals', 2015)
    Points  Rank    Team  Year
10     804     1  Royals  2015
('kings', 2015)
   Points  Rank   Team  Year
5     812     4  kings  2015
-----
   Points  Rank    Team  Year
0     876     1  Riders  2014
#+end_example

 Now comes the fun part. The *agg()* function returns a single aggregated value for each group. It takes a function on its own that does the actual work. Many of the /numpy/ functions are supported. Multiple aggregations per *agg()* call are also possible. To note is that *agg()* is usually applied to single column


  #+BEGIN_SRC python :results output 
  import pandas as pd
  import numpy as np

  ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
                       'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
              'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
              'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
              'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
  df = pd.DataFrame(ipl_data)

  grouped = df.groupby('Year')

  print(grouped['Points'].agg(np.mean))
  print("----")
  print(grouped['Points'].agg([np.sum, np.mean, np.std]))
  #+END_SRC

   
  #+begin_example
  Year
  2014    795.25
  2015    769.50
  2016    725.00
  2017    739.00
  Name: Points, dtype: float64
  ----
         sum    mean        std
  Year                         
  2014  3181  795.25  87.439026
  2015  3078  769.50  65.035888
  2016  1450  725.00  43.840620
  2017  1478  739.00  69.296465
  #+end_example
  
Groups can be filtered with the *filter()* function.
#+BEGIN_SRC python :results output
import pandas as pd
import numpy as np
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
print(df.groupby('Team').filter(lambda x: len(x) >= 3))
#+END_SRC
 
:     Points  Rank    Team  Year
: 0      876     1  Riders  2014
: 1      789     2  Riders  2015
: 4      741     3   Kings  2014
: 6      756     1   Kings  2016
: 7      788     1   Kings  2017
: 8      694     2  Riders  2016
: 11     690     2  Riders  2017


