org/posts/pandas_notes.org
* Concatenating
When working with a little bin more complex data like in /pandas/ the concatenation can become a tricky thing. /pandas/ offers a special function:
#+BEGIN_EXAMPLE
pd.concat(objs,axis=0,join='outer',join_axes=None,ignore_index=False)
#+END_EXAMPLE
The /axis/ parameter controls how the concatenation is done - either by columns or by rows (row default).

#+BEGIN_SRC python :results output
import pandas as pd
one = pd.DataFrame({
    'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
    'subject_id':['sub1','sub2','sub4','sub6','sub5'],
    'Marks_scored':[98,90,87,69,78]},
                   index=[1,2,3,4,5])
two = pd.DataFrame({
    'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
    'subject_id':['sub2','sub4','sub3','sub6','sub5'],
    'Marks_scored':[89,80,79,97,88]},
                   index=[1,2,3,4,5])
print(pd.concat([one,two]))
print("-------")
print(pd.concat([one,two],axis=1))
#+END_SRC

- by row

  #+begin_example
   Marks_scored    Name subject_id
 1            98    Alex       sub1
 2            90     Amy       sub2
 3            87   Allen       sub4
 4            69   Alice       sub6
 5            78  Ayoung       sub5
 1            89   Billy       sub2
 2            80   Brian       sub4
 3            79    Bran       sub3
 4            97   Bryce       sub6
 5            88   Betty       sub5

 #+end_example

- by column
  #+begin_example
   Marks_scored    Name subject_id  Marks_scored   Name subject_id
 1            98    Alex       sub1            89  Billy       sub2
 2            90     Amy       sub2            80  Brian       sub4
 3            87   Allen       sub4            79   Bran       sub3
 4            69   Alice       sub6            97  Bryce       sub6
 5            78  Ayoung       sub5            88  Betty       sub5
 #+end_example

By concatenation new labels can be assigned to the different parts:
#+BEGIN_SRC python :results output
import pandas as pd
one = pd.DataFrame({
    'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
    'subject_id':['sub1','sub2','sub4','sub6','sub5'],
    'Marks_scored':[98,90,87,69,78]},
                   index=[1,2,3,4,5])
two = pd.DataFrame({
    'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
    'subject_id':['sub2','sub4','sub3','sub6','sub5'],
    'Marks_scored':[89,80,79,97,88]},
                   index=[1,2,3,4,5])
print(pd.concat([one,two],keys=['x','y'],ignore_index=False))
#+END_SRC

#+begin_example
     Marks_scored    Name subject_id
x 1            98    Alex       sub1
  2            90     Amy       sub2
  3            87   Allen       sub4
  4            69   Alice       sub6
  5            78  Ayoung       sub5
y 1            89   Billy       sub2
  2            80   Brian       sub4
  3            79    Bran       sub3
  4            97   Bryce       sub6
  5            88   Betty       sub5
#+end_example
Later those new keys can be used in order to distinguish from which set the row came from.
\\
\\
Appending is also possible and it takes the simple form:
#+BEGIN_SRC python
one.append(two)
#+END_SRC


* Categories
A lot of times some string-fields in the data aren't just some random text but a repetitive and an element of some predefined set of possible values. Those are the categorical types of data. Something like [big, medium, small]. Categorical variables can take on only a limited, and usually fixed number of possible values. Besides the fixed length, categorical data might have an order but cannot perform the numerical operation. Categorical is a /Pandas/ data type.
\\
\\
A simple example to create a /Series/ object that only can contain [a, b, c]
#+BEGIN_SRC python :results output
import pandas as pd
s = pd.Series(["a","b","c","a"], dtype="category")
print(s)
#+END_SRC
This gives us:

: 0    a
: 1    b
: 2    c
: 3    a
: dtype: category
: Categories (3, object): [a, b, c]
There is also a /Categorical/ object in /pandas/ specifically for dealing with categorical data. The general constructor is as follows:
#+BEGIN_EXAMPLE
pandas.Categorical(values, categories, ordered)
#+END_EXAMPLE
If /categories/ aren't provided, they are inferred from the values. /ordered/ specifies whether or not on categories is bigger or not than other.
#+BEGIN_SRC python :results output
import pandas as pd
cat = cat=pd.Categorical(
    ['a','b','c','a','b','c','d'],
    ['c', 'b', 'a'],
    ordered=True)
print(cat)
#+END_SRC

: [a, b, c, a, b, c, NaN]
: Categories (3, object): [c < b < a]
\\
\\
*obj.cat.categories* command is used to get the categories of the object.
\\
\\
Removing categories is also something that comes in handy and of course it's possible with /pandas/
#+BEGIN_SRC python :results output
import pandas as pd

s = pd.Series(["a","b","c","a"], dtype="category")
print("Original object:")
print(s)

print("After removal:")
print( s.cat.remove_categories("a"))
#+END_SRC

#+begin_example
Original object:
0    a
1    b
2    c
3    a
dtype: category
Categories (3, object): [a, b, c]
After removal:
0    NaN
1      b
2      c
3    NaN
dtype: category
Categories (2, object): [b, c]
#+end_example


* Reading Data from /.csv/-files
At the beginning probably each applications loads some date from the file system or link or whatever. /pandas/ provides *IO API* for reading data from /.cvs/-files. The two main functions for reading text files are *read_csv()* and *read_table()*. They use similar procedures to intelligently convert tabular data into a /DataFrame/ object. The general form of the functions:
#+BEGIN_EXAMPLE
pandas.read_csv(filepath_or_buffer, sep=',', delimiter=None, header='infer',
names=None, index_col=None, usecols=None
---------
pandas.read_csv(filepath_or_buffer, sep='\t', delimiter=None, header='infer',
names=None, index_col=None, usecols=None
#+END_EXAMPLE
So say our *temp.cvs* looks like this:
#+BEGIN_EXAMPLE
S.No,Name,Age,City,Salary
1,Tom,28,Toronto,20000
2,Lee,32,HongKong,3000
3,Steven,43,Bay Area,8300
4,Ram,38,Hyderabad,3900
#+END_EXAMPLE
and represents this:
| S.No | Name   | Age | City      | Salary |
|------+--------+-----+-----------+--------|
|    1 | Tom    |  28 | Toronto   |  20000 |
|    2 | Lee    |  32 | HongKong  |   3000 |
|    3 | Steven |  43 | Bay Area  |   8300 |
|    4 | Ram    |  38 | Hyderabad |   3900 |
|------+--------+-----+-----------+--------|
We can read this as:
#+BEGIN_SRC python
import pandas as pd
df=pd.read_csv("temp.csv")
print(df)
#+END_SRC
A lot of the data in /.cvs/ files has a special column that specifies the index of the row. Pandas can take this into consideration:
#+BEGIN_SRC python
import pandas as pd

df=pd.read_csv("temp.csv",index_col=['S.No'])
print(df)
#+END_SRC
Skipping rows can be achieved through the /skiprows=n/ argument of *read_cvs()*


#  LocalWords:  ndarray dataset
