content/posts/pandas_notes.md


## Concatenating {#concatenating}

When working with a little bin more complex data like in _pandas_ the concatenation can become a tricky thing. _pandas_ offers a special function:

```text
pd.concat(objs,axis=0,join='outer',join_axes=None,ignore_index=False)
```

The _axis_ parameter controls how the concatenation is done - either by columns or by rows (row default).

```python
import pandas as pd
one = pd.DataFrame({
    'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
    'subject_id':['sub1','sub2','sub4','sub6','sub5'],
    'Marks_scored':[98,90,87,69,78]},
                   index=[1,2,3,4,5])
two = pd.DataFrame({
    'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
    'subject_id':['sub2','sub4','sub3','sub6','sub5'],
    'Marks_scored':[89,80,79,97,88]},
                   index=[1,2,3,4,5])
print(pd.concat([one,two]))
print("-------")
print(pd.concat([one,two],axis=1))
```

-   by row

    ```text
      Marks_scored    Name subject_id
    1            98    Alex       sub1
    2            90     Amy       sub2
    3            87   Allen       sub4
    4            69   Alice       sub6
    5            78  Ayoung       sub5
    1            89   Billy       sub2
    2            80   Brian       sub4
    3            79    Bran       sub3
    4            97   Bryce       sub6
    5            88   Betty       sub5

    ```

-   by column

    ```text
      Marks_scored    Name subject_id  Marks_scored   Name subject_id
    1            98    Alex       sub1            89  Billy       sub2
    2            90     Amy       sub2            80  Brian       sub4
    3            87   Allen       sub4            79   Bran       sub3
    4            69   Alice       sub6            97  Bryce       sub6
    5            78  Ayoung       sub5            88  Betty       sub5
    ```

By concatenation new labels can be assigned to the different parts:

```python
import pandas as pd
one = pd.DataFrame({
    'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
    'subject_id':['sub1','sub2','sub4','sub6','sub5'],
    'Marks_scored':[98,90,87,69,78]},
                   index=[1,2,3,4,5])
two = pd.DataFrame({
    'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
    'subject_id':['sub2','sub4','sub3','sub6','sub5'],
    'Marks_scored':[89,80,79,97,88]},
                   index=[1,2,3,4,5])
print(pd.concat([one,two],keys=['x','y'],ignore_index=False))
```

```text
     Marks_scored    Name subject_id
x 1            98    Alex       sub1
  2            90     Amy       sub2
  3            87   Allen       sub4
  4            69   Alice       sub6
  5            78  Ayoung       sub5
y 1            89   Billy       sub2
  2            80   Brian       sub4
  3            79    Bran       sub3
  4            97   Bryce       sub6
  5            88   Betty       sub5
```

Later those new keys can be used in order to distinguish from which set the row came from. <br /> <br /> Appending is also possible and it takes the simple form:

```python
one.append(two)
```


## Categories {#categories}

A lot of times some string-fields in the data aren't just some random text but a repetitive and an element of some predefined set of possible values. Those are the categorical types of data. Something like [big, medium, small]. Categorical variables can take on only a limited, and usually fixed number of possible values. Besides the fixed length, categorical data might have an order but cannot perform the numerical operation. Categorical is a _Pandas_ data type. <br /> <br /> A simple example to create a _Series_ object that only can contain [a, b, c]

```python
import pandas as pd
s = pd.Series(["a","b","c","a"], dtype="category")
print(s)
```

This gives us:

```text
0    a
1    b
2    c
3    a
dtype: category
Categories (3, object): [a, b, c]
```

There is also a _Categorical_ object in _pandas_ specifically for dealing with categorical data. The general constructor is as follows:

```text
pandas.Categorical(values, categories, ordered)
```

If _categories_ aren't provided, they are inferred from the values. _ordered_ specifies whether or not on categories is bigger or not than other.

```python
import pandas as pd
cat = cat=pd.Categorical(
    ['a','b','c','a','b','c','d'],
    ['c', 'b', 'a'],
    ordered=True)
print(cat)
```

```text
[a, b, c, a, b, c, NaN]
Categories (3, object): [c < b < a]
```

<br /> <br /> **obj.cat.categories** command is used to get the categories of the object. <br /> <br /> Removing categories is also something that comes in handy and of course it's possible with _pandas_

```python
import pandas as pd

s = pd.Series(["a","b","c","a"], dtype="category")
print("Original object:")
print(s)

print("After removal:")
print( s.cat.remove_categories("a"))
```

```text
Original object:
0    a
1    b
2    c
3    a
dtype: category
Categories (3, object): [a, b, c]
After removal:
0    NaN
1      b
2      c
3    NaN
dtype: category
Categories (2, object): [b, c]
```


## Reading Data from _.csv_-files {#reading-data-from-dot-csv-files}

At the beginning probably each applications loads some date from the file system or link or whatever. _pandas_ provides **IO API** for reading data from _.cvs_-files. The two main functions for reading text files are **read\_csv()** and **read\_table()**. They use similar procedures to intelligently convert tabular data into a _DataFrame_ object. The general form of the functions:

```text
pandas.read_csv(filepath_or_buffer, sep=',', delimiter=None, header='infer',
names=None, index_col=None, usecols=None
---------
pandas.read_csv(filepath_or_buffer, sep='\t', delimiter=None, header='infer',
names=None, index_col=None, usecols=None
```

So say our **temp.cvs** looks like this:

```text
S.No,Name,Age,City,Salary
1,Tom,28,Toronto,20000
2,Lee,32,HongKong,3000
3,Steven,43,Bay Area,8300
4,Ram,38,Hyderabad,3900
```

and represents this:

| S.No | Name   | Age | City      | Salary |
|------|--------|-----|-----------|--------|
| 1    | Tom    | 28  | Toronto   | 20000  |
| 2    | Lee    | 32  | HongKong  | 3000   |
| 3    | Steven | 43  | Bay Area  | 8300   |
| 4    | Ram    | 38  | Hyderabad | 3900   |

We can read this as:

```python
import pandas as pd
df=pd.read_csv("temp.csv")
print(df)
```

A lot of the data in _.cvs_ files has a special column that specifies the index of the row. Pandas can take this into consideration:

```python
import pandas as pd

df=pd.read_csv("temp.csv",index_col=['S.No'])
print(df)
```

Skipping rows can be achieved through the _skiprows=n_ argument of **read\_cvs()**
